hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpioq.h
// DELAYRH Configuration

#define	GPIOQ_DELAYRH_DELAY15				(0xFu<<28)
#define	GPIOQ_DELAYRH_DELAY15_0				(0x1u<<28)
#define	GPIOQ_DELAYRH_DELAY14				(0xFu<<24)
#define	GPIOQ_DELAYRH_DELAY14_0				(0x1u<<24)
#define	GPIOQ_DELAYRH_DELAY13				(0xFu<<20)
#define	GPIOQ_DELAYRH_DELAY13_0				(0x1u<<20)
#define	GPIOQ_DELAYRH_DELAY12				(0xFu<<16)
#define	GPIOQ_DELAYRH_DELAY12_0				(0x1u<<16)
#define	GPIOQ_DELAYRH_DELAY11				(0xFu<<12)
#define	GPIOQ_DELAYRH_DELAY11_0				(0x1u<<12)
#define	GPIOQ_DELAYRH_DELAY10				(0xFu<<8)
#define	GPIOQ_DELAYRH_DELAY10_0				(0x1u<<8)
#define	GPIOQ_DELAYRH_DELAY9				(0xFu<<4)
#define	GPIOQ_DELAYRH_DELAY9_0				(0x1u<<4)
#define	GPIOQ_DELAYRH_DELAY8				(0xFu<<0)
#define	GPIOQ_DELAYRH_DELAY8_0				(0x1u<<0)

// PIOCFGRL Configuration

#define	GPIOQ_PIOCFGRL_PIOCFG7				(0xFu<<28)
#define	GPIOQ_PIOCFGRL_PIOCFG7_0			(0x1u<<28)
#define	GPIOQ_PIOCFGRL_PIOCFG6				(0xFu<<24)
#define	GPIOQ_PIOCFGRL_PIOCFG6_0			(0x1u<<24)
#define	GPIOQ_PIOCFGRL_PIOCFG5				(0xFu<<20)
#define	GPIOQ_PIOCFGRL_PIOCFG5_0			(0x1u<<20)
#define	GPIOQ_PIOCFGRL_PIOCFG4				(0xFu<<16)
#define	GPIOQ_PIOCFGRL_PIOCFG4_0			(0x1u<<16)
#define	GPIOQ_PIOCFGRL_PIOCFG3				(0xFu<<12)
#define	GPIOQ_PIOCFGRL_PIOCFG3_0			(0x1u<<12)
#define	GPIOQ_PIOCFGRL_PIOCFG2				(0xFu<<8)
#define	GPIOQ_PIOCFGRL_PIOCFG2_0			(0x1u<<8)
#define	GPIOQ_PIOCFGRL_PIOCFG1				(0xFu<<4)
#define	GPIOQ_PIOCFGRL_PIOCFG1_0			(0x1u<<4)
#define	GPIOQ_PIOCFGRL_PIOCFG0				(0xFu<<0)
#define	GPIOQ_PIOCFGRL_PIOCFG0_0			(0x1u<<0)

#define	GPIOQ_PIOCFGRL_PIOCFG7_B_0X0		(0x0u<<28)
#define	GPIOQ_PIOCFGRL_PIOCFG7_B_0X1		(0x1u<<28)
#define	GPIOQ_PIOCFGRL_PIOCFG6_B_0X0		(0x0u<<24)
#define	GPIOQ_PIOCFGRL_PIOCFG6_B_0X1		(0x1u<<24)
#define	GPIOQ_PIOCFGRL_PIOCFG5_B_0X0		(0x0u<<20)
#define	GPIOQ_PIOCFGRL_PIOCFG5_B_0X1		(0x1u<<20)
#define	GPIOQ_PIOCFGRL_PIOCFG4_B_0X0		(0x0u<<16)
#define	GPIOQ_PIOCFGRL_PIOCFG4_B_0X1		(0x1u<<16)
#define	GPIOQ_PIOCFGRL_PIOCFG3_B_0X0		(0x0u<<12)
#define	GPIOQ_PIOCFGRL_PIOCFG3_B_0X1		(0x1u<<12)
#define	GPIOQ_PIOCFGRL_PIOCFG2_B_0X0		(0x0u<<8)
#define	GPIOQ_PIOCFGRL_PIOCFG2_B_0X1		(0x1u<<8)
#define	GPIOQ_PIOCFGRL_PIOCFG1_B_0X0		(0x0u<<4)
#define	GPIOQ_PIOCFGRL_PIOCFG1_B_0X1		(0x1u<<4)
#define	GPIOQ_PIOCFGRL_PIOCFG0_B_0X0		(0x0u<<0)
#define	GPIOQ_PIOCFGRL_PIOCFG0_B_0X1		(0x1u<<0)

// PIOCFGRH Configuration

#define	GPIOQ_PIOCFGRH_PIOCFG15				(0xFu<<28)
#define	GPIOQ_PIOCFGRH_PIOCFG15_0			(0x1u<<28)
#define	GPIOQ_PIOCFGRH_PIOCFG14				(0xFu<<24)
#define	GPIOQ_PIOCFGRH_PIOCFG14_0			(0x1u<<24)
#define	GPIOQ_PIOCFGRH_PIOCFG13				(0xFu<<20)
#define	GPIOQ_PIOCFGRH_PIOCFG13_0			(0x1u<<20)
#define	GPIOQ_PIOCFGRH_PIOCFG12				(0xFu<<16)
#define	GPIOQ_PIOCFGRH_PIOCFG12_0			(0x1u<<16)
#define	GPIOQ_PIOCFGRH_PIOCFG11				(0xFu<<12)
#define	GPIOQ_PIOCFGRH_PIOCFG11_0			(0x1u<<12)
#define	GPIOQ_PIOCFGRH_PIOCFG10				(0xFu<<8)
#define	GPIOQ_PIOCFGRH_PIOCFG10_0			(0x1u<<8)
#define	GPIOQ_PIOCFGRH_PIOCFG9				(0xFu<<4)
#define	GPIOQ_PIOCFGRH_PIOCFG9_0			(0x1u<<4)
#define	GPIOQ_PIOCFGRH_PIOCFG8				(0xFu<<0)
#define	GPIOQ_PIOCFGRH_PIOCFG8_0			(0x1u<<0)

// HWCFGR10 Configuration

#define	GPIOQ_HWCFGR10_OR_CFG				(0xFu<<20)
#define	GPIOQ_HWCFGR10_OR_CFG_0				(0x1u<<20)
#define	GPIOQ_HWCFGR10_SEC_CFG				(0xFu<<16)
#define	GPIOQ_HWCFGR10_SEC_CFG_0			(0x1u<<16)
#define	GPIOQ_HWCFGR10_LOCK_CFG				(0xFu<<12)
#define	GPIOQ_HWCFGR10_LOCK_CFG_0			(0x1u<<12)
#define	GPIOQ_HWCFGR10_SPEED_CFG			(0xFu<<8)
#define	GPIOQ_HWCFGR10_SPEED_CFG_0			(0x1u<<8)
#define	GPIOQ_HWCFGR10_AFSIZE_CFG			(0xFu<<4)
#define	GPIOQ_HWCFGR10_AFSIZE_CFG_0			(0x1u<<4)
#define	GPIOQ_HWCFGR10_AHB_IOP				(0xFu<<0)
#define	GPIOQ_HWCFGR10_AHB_IOP_0			(0x1u<<0)

#define	GPIOQ_HWCFGR10_OR_CFG_B_0X0			(0x0u<<20)
#define	GPIOQ_HWCFGR10_OR_CFG_B_0X1			(0x1u<<20)
#define	GPIOQ_HWCFGR10_SEC_CFG_B_0X0		(0x0u<<16)
#define	GPIOQ_HWCFGR10_SEC_CFG_B_0X1		(0x1u<<16)
#define	GPIOQ_HWCFGR10_LOCK_CFG_B_0X0		(0x0u<<12)
#define	GPIOQ_HWCFGR10_LOCK_CFG_B_0X1		(0x1u<<12)
#define	GPIOQ_HWCFGR10_SPEED_CFG_B_0X0		(0x0u<<8)
#define	GPIOQ_HWCFGR10_SPEED_CFG_B_0X1		(0x1u<<8)
#define	GPIOQ_HWCFGR10_AFSIZE_CFG_B_0X1		(0x1u<<4)
#define	GPIOQ_HWCFGR10_AHB_IOP_B_0X0		(0x0u<<0)
#define	GPIOQ_HWCFGR10_AHB_IOP_B_0X1		(0x1u<<0)

// HWCFGR9 Configuration

#define	GPIOQ_HWCFGR9_EN_IO					(0xFFFFu<<0)
#define	GPIOQ_HWCFGR9_EN_IO_0				(0x1u<<0)

#define	GPIOQ_HWCFGR9_EN_IO_B_0X0			(0x0u<<0)
#define	GPIOQ_HWCFGR9_EN_IO_B_0X1			(0x1u<<0)

// HWCFGR8 Configuration

#define	GPIOQ_HWCFGR8_FAST_AF_IO15			(0xFu<<28)
#define	GPIOQ_HWCFGR8_FAST_AF_IO15_0		(0x1u<<28)
#define	GPIOQ_HWCFGR8_FAST_AF_IO14			(0xFu<<24)
#define	GPIOQ_HWCFGR8_FAST_AF_IO14_0		(0x1u<<24)
#define	GPIOQ_HWCFGR8_FAST_AF_IO13			(0xFu<<20)
#define	GPIOQ_HWCFGR8_FAST_AF_IO13_0		(0x1u<<20)
#define	GPIOQ_HWCFGR8_FAST_AF_IO12			(0xFu<<16)
#define	GPIOQ_HWCFGR8_FAST_AF_IO12_0		(0x1u<<16)
#define	GPIOQ_HWCFGR8_FAST_AF_IO11			(0xFu<<12)
#define	GPIOQ_HWCFGR8_FAST_AF_IO11_0		(0x1u<<12)
#define	GPIOQ_HWCFGR8_FAST_AF_IO10			(0xFu<<8)
#define	GPIOQ_HWCFGR8_FAST_AF_IO10_0		(0x1u<<8)
#define	GPIOQ_HWCFGR8_FAST_AF_IO9			(0xFu<<4)
#define	GPIOQ_HWCFGR8_FAST_AF_IO9_0			(0x1u<<4)
#define	GPIOQ_HWCFGR8_FAST_AF_IO8			(0xFu<<0)
#define	GPIOQ_HWCFGR8_FAST_AF_IO8_0			(0x1u<<0)

// HWCFGR7 Configuration

#define	GPIOQ_HWCFGR7_FAST_AF_IO7			(0xFu<<28)
#define	GPIOQ_HWCFGR7_FAST_AF_IO7_0			(0x1u<<28)
#define	GPIOQ_HWCFGR7_FAST_AF_IO6			(0xFu<<24)
#define	GPIOQ_HWCFGR7_FAST_AF_IO6_0			(0x1u<<24)
#define	GPIOQ_HWCFGR7_FAST_AF_IO5			(0xFu<<20)
#define	GPIOQ_HWCFGR7_FAST_AF_IO5_0			(0x1u<<20)
#define	GPIOQ_HWCFGR7_FAST_AF_IO4			(0xFu<<16)
#define	GPIOQ_HWCFGR7_FAST_AF_IO4_0			(0x1u<<16)
#define	GPIOQ_HWCFGR7_FAST_AF_IO3			(0xFu<<12)
#define	GPIOQ_HWCFGR7_FAST_AF_IO3_0			(0x1u<<12)
#define	GPIOQ_HWCFGR7_FAST_AF_IO2			(0xFu<<8)
#define	GPIOQ_HWCFGR7_FAST_AF_IO2_0			(0x1u<<8)
#define	GPIOQ_HWCFGR7_FAST_AF_IO1			(0xFu<<4)
#define	GPIOQ_HWCFGR7_FAST_AF_IO1_0			(0x1u<<4)
#define	GPIOQ_HWCFGR7_FAST_AF_IO0			(0xFu<<0)
#define	GPIOQ_HWCFGR7_FAST_AF_IO0_0			(0x1u<<0)

// HWCFGR6 Configuration

#define	GPIOQ_HWCFGR6_MODER_RES				(0xFFFFFFFFu<<0)
#define	GPIOQ_HWCFGR6_MODER_RES_0			(0x1u<<0)

// HWCFGR5 Configuration

#define	GPIOQ_HWCFGR5_PUPDR_RES				(0xFFFFFFFFu<<0)
#define	GPIOQ_HWCFGR5_PUPDR_RES_0			(0x1u<<0)

// HWCFGR4 Configuration

#define	GPIOQ_HWCFGR4_OSPEED_RES			(0xFFFFFFFFu<<0)
#define	GPIOQ_HWCFGR4_OSPEED_RES_0			(0x1u<<0)

// HWCFGR3 Configuration

#define	GPIOQ_HWCFGR3_OTYPER_RES			(0xFFFFu<<16)
#define	GPIOQ_HWCFGR3_OTYPER_RES_0			(0x1u<<16)
#define	GPIOQ_HWCFGR3_ODR_RES				(0xFFFFu<<0)
#define	GPIOQ_HWCFGR3_ODR_RES_0				(0x1u<<0)

// HWCFGR2 Configuration

#define	GPIOQ_HWCFGR2_AFRL_RES				(0xFFFFFFFFu<<0)
#define	GPIOQ_HWCFGR2_AFRL_RES_0			(0x1u<<0)

// HWCFGR1 Configuration

#define	GPIOQ_HWCFGR1_AFRH_RES				(0xFFFFFFFFu<<0)
#define	GPIOQ_HWCFGR1_AFRH_RES_0			(0x1u<<0)

// HWCFGR0 Configuration

#define	GPIOQ_HWCFGR0_OR_RES				(0xFFFFu<<0)
#define	GPIOQ_HWCFGR0_OR_RES_0				(0x1u<<0)

// VERR Configuration

#define	GPIOQ_VERR_MAJREV					(0xFu<<4)
#define	GPIOQ_VERR_MAJREV_0					(0x1u<<4)
#define	GPIOQ_VERR_MINREV					(0xFu<<0)
#define	GPIOQ_VERR_MINREV_0					(0x1u<<0)

// IPIDR Configuration

#define	GPIOQ_IPIDR_IPID					(0xFFFFFFFFu<<0)
#define	GPIOQ_IPIDR_IPID_0					(0x1u<<0)

// SIDR Configuration

#define	GPIOQ_SIDR_SID						(0xFFFFFFFFu<<0)
#define	GPIOQ_SIDR_SID_0					(0x1u<<0)
